---
kind: property
id: P:Autodesk.Revit.DB.Events.ProgressChangedEventArgs.UpperRange
source: html/2f7248a7-de59-7352-e8ed-38dfc386b5ab.htm
---
# Autodesk.Revit.DB.Events.ProgressChangedEventArgs.UpperRange Property

Upper part of progress bar range - will be any non-zero number

## Syntax (C#)
```csharp
public int UpperRange { get; }
```